# ---------------------------------------
# Taps
# ---------------------------------------
tap "sanemat/font"                  # カスタムフォントリポジトリ
tap "homebrew/cask-fonts"           # フォント用タップ

# ---------------------------------------
# Casks: GUI アプリケーション
# ---------------------------------------
cask "alt-tab"                      # macOS のウィンドウ操作補助
cask "aws-vault"                    # AWS 認証管理ツール
cask "bitwarden"                    # パスワードマネージャ
cask "cleanshot"                    # スクリーンショットツール
cask "discord"                      # コミュニケーションツール
cask "drawio"                       # ダイアグラム作成ツール
cask "firefox"                      # ウェブブラウザ
cask "font-meslo-lg-nerd-font"      # ターミナル向け Nerd フォント
cask "google-chrome"                # ウェブブラウザ
cask "google-cloud-sdk"             # GCP CLI
cask "google-japanese-ime"          # 日本語入力
cask "logi-options+"                # ロジクール製品の設定ツール
cask "raycast"                      # 生産性向上ツール
cask "visual-studio-code"           # コードエディタ
cask "vmware-fusion"                # 仮想化ツール

# ---------------------------------------
# Formulae: CLI ツール
# ---------------------------------------
brew "awscli"                       # AWS CLI
brew "azure-cli"                    # Azure CLI
brew "cdrtools"                     # ディスクツール
brew "gh"                           # GitHub CLI
brew "git"                          # Git バージョン管理
brew "git-lfs"                      # Git Large File Storage
brew "hstr"                         # ヒストリ検索補助
brew "mas"                          # Mac App Store CLI
brew "node"                         # Node.js ランタイム
brew "tfenv"                        # Terraform バージョン管理
brew "transmission-cli"             # Transmission CLI
brew "wimlib"                       # WIM ファイル操作
brew "zsh-completions"              # Zsh 補完

# ---------------------------------------
# Mac App Store アプリ
# ---------------------------------------
mas "Microsoft Remote Desktop", id: 1295203466 # リモートデスクトップアプリ
