# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/core"
tap "homebrew/cask"
tap "sanemat/font"

# デスクトップアプリケーションの管理
cask "visual-studio-code"
cask "drawio"
cask "aws-cli"
cask "aws-vault"
cask "firefox"
cask "krisp"
cask "microsoft-teams"
cask "google-cloud-sdk"
cask "bitwarden"
cask "discord"
cask "alt-tab"
cask "cleanshot"

# CLIアプリケーションの管理
brew "git"
brew "git-lfs"
brew "awscli"
brew "mas"
brew "tfenv"
brew "zsh-completions"
brew "wimlib" 
brew "cdrtools" 
brew "github"
brew "hstr"

# Mac App Storeのアプリケーションを管理
mas "EasyRes", id: 688211836 #解像度変更ツール
mas "MUT", id: 1133234759 #Jamf インポートツール
mas "Microsoft Remote Desktop", id: 1295203466 #RDPツール
mas "BetterSnapTool", id: 417375580 #画面分割ツール