# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "homebrew/core"
tap "homebrew/cask"

# デスクトップアプリケーションの管理
cask "visual-studio-code"
## cask "google-chrome"
cask "docker"
cask "postman"
cask "drawio"
cask "aws-cli"
cask "clipy"
cask "powershell"
cask "aws-vault"
cask "gather"
cask "firefox"
cask "notion"
cask "krisp"

# CLIアプリケーションの管理
brew "git"
brew "git-lfs"
brew "docker"
brew "awscli"
brew "mas"
brew "tfenv"
brew "zsh-completions"
brew "ffmpeg"
brew "azure-cli"

# Mac App Storeのアプリケーションを管理
mas "EasyRes", id: 688211836 #解像度変更ツール
mas "MUT", id: 1133234759 #Jamf インポートツール
mas "RunCat", id: 1429033973 #リソース監視ツール
mas "Microsoft Remote Desktop", id: 1295203466 #RDPツール
mas "BetterSnapTool", id: 417375580 #画面分割ツール